### development Part # 1
  #### Terraform Format and Style 🖌`skipped`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/5d069615-040f-43d1-b7b7-5b77cb88c028/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.hello_world will be created
  + resource "aws_ecs_service" "hello_world" {
      + cluster                            = "arn:aws:ecs:us-west-1:012119841372:cluster/Cashews-development-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "hello-world-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + task_definition                    = "arn:aws:ecs:us-west-1:012119841372:task-definition/hello-world-app:1"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "hello-world-app"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:012119841372:targetgroup/hw-tg/05b93cd2cea7b946"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0f092658ed6b65643",
            ]
          + subnets          = [
              + "subnet-07eb078da6ab7d21e",
              + "subnet-0fe6bf1a3b96f8533",
            ]
        }
    }

  # aws_flow_log.default must be replaced
-/+ resource "aws_flow_log" "default" {
      ~ arn                      = "arn:aws:ec2:us-west-1:012119841372:vpc-flow-log/fl-0dc78d56a9e57b000" -> (known after apply)
      + iam_role_arn             = "arn:aws:iam::012119841372:role/vpc-fl-role" # forces replacement
      ~ id                       = "fl-0dc78d56a9e57b000" -> (known after apply)
      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)
      + log_group_name           = (known after apply)
      - tags                     = {} -> null
        # (6 unchanged attributes hidden)

      - destination_options {
          - file_format                = "plain-text" -> null
          - hive_compatible_partitions = false -> null
          - per_hour_partition         = false -> null
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecs_service.hello_world will be created%0A  + resource "aws_ecs_service" "hello_world" {%0A      + cluster                            = "arn:aws:ecs:us-west-1:012119841372:cluster/Cashews-development-cluster"%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "hello-world-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + task_definition                    = "arn:aws:ecs:us-west-1:012119841372:task-definition/hello-world-app:1"%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "hello-world-app"%0A          + container_port   = 3000%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:012119841372:targetgroup/hw-tg/05b93cd2cea7b946"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-0f092658ed6b65643",%0A            ]%0A          + subnets          = [%0A              + "subnet-07eb078da6ab7d21e",%0A              + "subnet-0fe6bf1a3b96f8533",%0A            ]%0A        }%0A    }%0A%0A  # aws_flow_log.default must be replaced%0A-/+ resource "aws_flow_log" "default" {%0A      ~ arn                      = "arn:aws:ec2:us-west-1:012119841372:vpc-flow-log/fl-0dc78d56a9e57b000" -> (known after apply)%0A      + iam_role_arn             = "arn:aws:iam::012119841372:role/vpc-fl-role" # forces replacement%0A      ~ id                       = "fl-0dc78d56a9e57b000" -> (known after apply)%0A      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)%0A      + log_group_name           = (known after apply)%0A      - tags                     = {} -> null%0A        # (6 unchanged attributes hidden)%0A%0A      - destination_options {%0A          - file_format                = "plain-text" -> null%0A          - hive_compatible_partitions = false -> null%0A          - per_hour_partition         = false -> null%0A        }%0A    }%0A%0APlan: 2 to add, 0 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecs_service.hello_world will be created%0A  + resource "aws_ecs_service" "hello_world" {%0A      + cluster                            = "arn:aws:ecs:us-west-1:012119841372:cluster/Cashews-development-cluster"%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "hello-world-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + task_definition                    = "arn:aws:ecs:us-west-1:012119841372:task-definition/hello-world-app:1"%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "hello-world-app"%0A          + container_port   = 3000%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:012119841372:targetgroup/hw-tg/05b93cd2cea7b946"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-0f092658ed6b65643",%0A            ]%0A          + subnets          = [%0A              + "subnet-07eb078da6ab7d21e",%0A              + "subnet-0fe6bf1a3b96f8533",%0A            ]%0A        }%0A    }%0A%0A  # aws_flow_log.default must be replaced%0A-/+ resource "aws_flow_log" "default" {%0A      ~ arn                      = "arn:aws:ec2:us-west-1:012119841372:vpc-flow-log/fl-0dc78d56a9e57b000" -> (known after apply)%0A      + iam_role_arn             = "arn:aws:iam::012119841372:role/vpc-fl-role" # forces replacement%0A      ~ id                       = "fl-0dc78d56a9e57b000" -> (known after apply)%0A      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)%0A      + log_group_name           = (known after apply)%0A      - tags                     = {} -> null%0A        # (6 unchanged attributes hidden)%0A%0A      - destination_options {%0A          - file_format                = "plain-text" -> null%0A          - hive_compatible_partitions = false -> null%0A          - per_hour_partition         = false -> null%0A        }%0A    }%0A%0APlan: 2 to add, 0 to change, 1 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0

  ```
  </details>
  *Pusher: @cashewhands, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*